jantielens/esp32-macropad/src/app/device_telemetry.cpp
#include "device_telemetry.h"

#include "config_manager.h"
#include "log_manager.h"
#include "board_config.h"
#include "fs_health.h"
#include "sensors/sensor_manager.h"
#include "image_fetch.h"

#include <Arduino.h>
#include <WiFi.h>
#include "soc/soc_caps.h"
#include <esp_heap_caps.h>
#include <esp_attr.h>
#include <esp_rom_sys.h>
#include <freertos/FreeRTOS.h>
#include <freertos/task.h>
#include <freertos/semphr.h>
#include <freertos/timers.h>
#include <freertos/idf_additions.h>
#include <esp_timer.h>
#include <esp_idf_version.h>

// Per-core idle-task run-time counter API was added in ESP-IDF v5.x.
// Inkplate's bundled arduino-esp32 fork ships an older IDF (4.x) that lacks
// `configRUN_TIME_COUNTER_TYPE` and `ulTaskGetIdleRunTimeCounterForCore`. On
// that platform we compile out the per-core sampler entirely and report -1.
#if (ESP_IDF_VERSION_MAJOR >= 5)
#define TELEMETRY_HAS_PER_CORE_IDLE_COUNTER 1
#else
#define TELEMETRY_HAS_PER_CORE_IDLE_COUNTER 0
#endif

#if HAS_MQTT
#include "mqtt_manager.h"
#endif

#if HAS_DISPLAY
#include "display_manager.h"
#endif

#if HAS_BLE_HID
#include "ble_hid.h"
extern DeviceConfig device_config;
#endif

// Temperature sensor support (ESP32-C3, ESP32-S2, ESP32-S3, ESP32-C2, ESP32-C6, ESP32-H2)
#if SOC_TEMP_SENSOR_SUPPORTED
#include "driver/temperature_sensor.h"
#endif

// Cached WiFi RSSI — sampled once at boot (and optionally on reconnect) to
// avoid repeated ESP-Hosted RPC calls from the hot health-publish path.
static int16_t s_cached_rssi = 0;
static bool    s_rssi_valid  = false;

struct RuntimeDiagnostics {
	DeviceRuntimePhase main_phase;
	DeviceRuntimePhase lvgl_phase;
	uint32_t main_progress_ms;
	uint32_t lvgl_progress_ms;
	uint32_t display_lock_acquired_ms;
	uint32_t display_lock_wait_started_ms;
	bool display_lock_held;
	bool display_lock_owner_lvgl;
	bool display_lock_waiting;
	char lvgl_extension_id[32];
	uint32_t sleep_refresh_attempt_count;
	uint32_t sleep_refresh_attempted_ms;
	uint32_t sleep_refresh_completed_ms;
	uint32_t async_flush_started_ms;
	uint32_t async_flush_completed_ms;
	uint32_t async_flush_error_count;
	bool async_flush_in_flight;
	uint32_t extension_tick_started_ms;
	uint32_t extension_tick_completed_ms;
	uint32_t extension_tick_last_duration_ms;
	uint32_t extension_tick_max_duration_ms;
	uint32_t extension_tick_slow_count;
};

DRAM_ATTR static portMUX_TYPE s_runtime_diagnostics_mux = portMUX_INITIALIZER_UNLOCKED;
DRAM_ATTR static RuntimeDiagnostics s_runtime_diagnostics = {};

static const char* runtime_phase_name(DeviceRuntimePhase phase) {
	switch (phase) {
		case DEVICE_RUNTIME_PHASE_MAIN_SCREEN_SAVER: return "screen_saver";
		case DEVICE_RUNTIME_PHASE_MAIN_ACTION_DISPATCH: return "action_dispatch";
		case DEVICE_RUNTIME_PHASE_MAIN_CAMERA_FEED: return "camera_feed";
		case DEVICE_RUNTIME_PHASE_MAIN_DISPLAY_EFFECTS: return "display_effects";
		case DEVICE_RUNTIME_PHASE_MAIN_TOUCH: return "touch";
		case DEVICE_RUNTIME_PHASE_MAIN_PORTAL: return "portal";
		case DEVICE_RUNTIME_PHASE_MAIN_NETWORK: return "network";
		case DEVICE_RUNTIME_PHASE_MAIN_SENSORS: return "sensors";
		case DEVICE_RUNTIME_PHASE_MAIN_BUTTONS: return "buttons";
		case DEVICE_RUNTIME_PHASE_MAIN_HOUSEKEEPING: return "housekeeping";
		case DEVICE_RUNTIME_PHASE_LVGL_WAIT_LOCK: return "wait_lock";
		case DEVICE_RUNTIME_PHASE_LVGL_DEFERRED_WORK: return "deferred_work";
		case DEVICE_RUNTIME_PHASE_LVGL_SCREEN_SWITCH: return "screen_switch";
		case DEVICE_RUNTIME_PHASE_LVGL_TIMER: return "timer";
		case DEVICE_RUNTIME_PHASE_LVGL_SCREEN_UPDATE: return "screen_update";
		case DEVICE_RUNTIME_PHASE_LVGL_FLUSH: return "flush";
		case DEVICE_RUNTIME_PHASE_LVGL_SLEEP: return "sleep";
		case DEVICE_RUNTIME_PHASE_UNKNOWN:
		default: return "unknown";
	}
}

void device_telemetry_mark_main_loop(DeviceRuntimePhase phase) {
	portENTER_CRITICAL(&s_runtime_diagnostics_mux);
	s_runtime_diagnostics.main_phase = phase;
	s_runtime_diagnostics.main_progress_ms = millis();
	portEXIT_CRITICAL(&s_runtime_diagnostics_mux);
}

void device_telemetry_mark_lvgl_task(DeviceRuntimePhase phase) {
	portENTER_CRITICAL(&s_runtime_diagnostics_mux);
	s_runtime_diagnostics.lvgl_phase = phase;
	s_runtime_diagnostics.lvgl_progress_ms = millis();
	if (phase != DEVICE_RUNTIME_PHASE_LVGL_TIMER) {
		s_runtime_diagnostics.lvgl_extension_id[0] = '\0';
	}
	portEXIT_CRITICAL(&s_runtime_diagnostics_mux);
}

void device_telemetry_mark_lvgl_extension_tick(const char* extension_id) {
	portENTER_CRITICAL(&s_runtime_diagnostics_mux);
	s_runtime_diagnostics.lvgl_phase = DEVICE_RUNTIME_PHASE_LVGL_TIMER;
	s_runtime_diagnostics.lvgl_progress_ms = millis();
	s_runtime_diagnostics.extension_tick_started_ms = s_runtime_diagnostics.lvgl_progress_ms;
	strlcpy(s_runtime_diagnostics.lvgl_extension_id, extension_id ? extension_id : "",
				 sizeof(s_runtime_diagnostics.lvgl_extension_id));
	portEXIT_CRITICAL(&s_runtime_diagnostics_mux);
}

void device_telemetry_mark_lvgl_extension_tick_complete(uint32_t elapsed_ms) {
	portENTER_CRITICAL(&s_runtime_diagnostics_mux);
	s_runtime_diagnostics.extension_tick_last_duration_ms = elapsed_ms;
	if (elapsed_ms > s_runtime_diagnostics.extension_tick_max_duration_ms) {
		s_runtime_diagnostics.extension_tick_max_duration_ms = elapsed_ms;
	}
	if (elapsed_ms > DEVICE_TELEMETRY_SLOW_EXTENSION_TICK_MS) {
		s_runtime_diagnostics.extension_tick_slow_count++;
	}
	s_runtime_diagnostics.lvgl_extension_id[0] = '\0';
	portEXIT_CRITICAL(&s_runtime_diagnostics_mux);
}

void device_telemetry_mark_display_lock_wait() {
	portENTER_CRITICAL(&s_runtime_diagnostics_mux);
	s_runtime_diagnostics.display_lock_waiting = true;
	s_runtime_diagnostics.display_lock_wait_started_ms = millis();
	portEXIT_CRITICAL(&s_runtime_diagnostics_mux);
}

void device_telemetry_mark_display_lock_acquired(bool by_lvgl_task) {
	portENTER_CRITICAL(&s_runtime_diagnostics_mux);
	s_runtime_diagnostics.display_lock_held = true;
	s_runtime_diagnostics.display_lock_owner_lvgl = by_lvgl_task;
	s_runtime_diagnostics.display_lock_acquired_ms = millis();
	s_runtime_diagnostics.display_lock_waiting = false;
	portEXIT_CRITICAL(&s_runtime_diagnostics_mux);
}

void device_telemetry_mark_display_lock_released() {
	portENTER_CRITICAL(&s_runtime_diagnostics_mux);
	s_runtime_diagnostics.display_lock_held = false;
	s_runtime_diagnostics.display_lock_owner_lvgl = false;
	portEXIT_CRITICAL(&s_runtime_diagnostics_mux);
}

void device_telemetry_mark_sleep_refresh_attempt() {
	portENTER_CRITICAL(&s_runtime_diagnostics_mux);
	s_runtime_diagnostics.sleep_refresh_attempt_count++;
	s_runtime_diagnostics.sleep_refresh_attempted_ms = millis();
	portEXIT_CRITICAL(&s_runtime_diagnostics_mux);
}

