jantielens/esp32-macropad/src/app/device_telemetry.cpp
void device_telemetry_log_memory_snapshot(const char *tag) {
		size_t heap_free = 0;
		size_t heap_min = 0;
		size_t heap_largest = 0;
		size_t internal_free = 0;
		size_t internal_min = 0;
		size_t psram_free = 0;
		size_t psram_min = 0;
		size_t psram_largest = 0;

		get_memory_snapshot(
				&heap_free,
				&heap_min,
				&heap_largest,
				&internal_free,
				&internal_min,
				&psram_free,
				&psram_min,
				&psram_largest
		);

		// Keep this line short to avoid fixed log buffers truncating the output.
		// Keys:
		// hf=heap_free hm=heap_min hl=heap_largest hi=internal_free hin=internal_min
		// pf=psram_free pm=psram_min pl=psram_largest
		// frag=heap fragmentation percent (based on hl/hf)

		unsigned frag_percent = 0;
		if (heap_free > 0) {
				float fragmentation = (1.0f - ((float)heap_largest / (float)heap_free)) * 100.0f;
				if (fragmentation < 0) fragmentation = 0;
				if (fragmentation > 100) fragmentation = 100;
				frag_percent = (unsigned)fragmentation;
		}

		LOGI(
				"Mem",
				"%s hf=%u hm=%u hl=%u hi=%u hin=%u frag=%u pf=%u pm=%u pl=%u",
				tag ? tag : "(null)",
				(unsigned)heap_free,
				(unsigned)heap_min,
				(unsigned)heap_largest,
				(unsigned)internal_free,
				(unsigned)internal_min,
				(unsigned)frag_percent,
				(unsigned)psram_free,
				(unsigned)psram_min,
				(unsigned)psram_largest
		);
}

void device_telemetry_fill_api(JsonDocument &doc) {
		fill_common(doc, true, true, true);

			RuntimeDiagnostics runtime = {};
			portENTER_CRITICAL(&s_runtime_diagnostics_mux);
			runtime = s_runtime_diagnostics;
			portEXIT_CRITICAL(&s_runtime_diagnostics_mux);
			const uint32_t now_ms = millis();
			JsonObject runtime_doc = doc["runtime"].to<JsonObject>();
			runtime_doc["main_phase"] = runtime_phase_name(runtime.main_phase);
			runtime_doc["main_age_ms"] = runtime.main_progress_ms
				? now_ms - runtime.main_progress_ms : 0;
			runtime_doc["lvgl_phase"] = runtime_phase_name(runtime.lvgl_phase);
			runtime_doc["lvgl_age_ms"] = runtime.lvgl_progress_ms
				? now_ms - runtime.lvgl_progress_ms : 0;
			runtime_doc["lvgl_extension"] = runtime.lvgl_extension_id[0]
				? runtime.lvgl_extension_id : nullptr;
			runtime_doc["extension_tick_age_ms"] = runtime.lvgl_extension_id[0]
				? now_ms - runtime.extension_tick_started_ms : 0;
			runtime_doc["extension_tick_last_duration_ms"] = runtime.extension_tick_last_duration_ms;
			runtime_doc["extension_tick_max_duration_ms"] = runtime.extension_tick_max_duration_ms;
			runtime_doc["extension_tick_slow_count"] = runtime.extension_tick_slow_count;
			runtime_doc["display_lock_held"] = runtime.display_lock_held;
			runtime_doc["display_lock_owner"] = runtime.display_lock_held
				? (runtime.display_lock_owner_lvgl ? "lvgl" : "other") : "none";
			runtime_doc["display_lock_held_ms"] = runtime.display_lock_held
				? now_ms - runtime.display_lock_acquired_ms : 0;
			runtime_doc["display_lock_waiting"] = runtime.display_lock_waiting;
			runtime_doc["display_lock_wait_age_ms"] = runtime.display_lock_waiting
				? now_ms - runtime.display_lock_wait_started_ms : 0;
			runtime_doc["sleep_refresh_attempts"] = runtime.sleep_refresh_attempt_count;
			runtime_doc["sleep_refresh_attempt_age_ms"] = runtime.sleep_refresh_attempted_ms
				? now_ms - runtime.sleep_refresh_attempted_ms : 0;
			runtime_doc["sleep_refresh_complete_age_ms"] = runtime.sleep_refresh_completed_ms
				? now_ms - runtime.sleep_refresh_completed_ms : 0;
			runtime_doc["async_flush_in_flight"] = runtime.async_flush_in_flight;
			runtime_doc["async_flush_started_age_ms"] = runtime.async_flush_in_flight
				? now_ms - runtime.async_flush_started_ms : 0;
			runtime_doc["async_flush_complete_age_ms"] = runtime.async_flush_completed_ms
				? now_ms - runtime.async_flush_completed_ms : 0;
			runtime_doc["async_flush_errors"] = runtime.async_flush_error_count;

		// Min/max fields sampled by a background timer (multi-client safe).
		// We report a merged snapshot across the last complete window and the current
		// in-progress window to reduce the chance of missing short spikes around
		// rollovers without storing any time series.
		fill_health_window_fields(doc);

		// BLE HID state (API-only)
		#if HAS_BLE_HID
		doc["ble_state"] = device_config.ble_enabled ? ble_hid_state() : "disabled";
		doc["ble_status"] = device_config.ble_enabled ? ble_hid_status() : "disabled";
		if (device_config.ble_enabled && ble_hid_is_initialized()) {
				doc["ble_name"] = ble_hid_name();
				doc["ble_bonded"] = ble_hid_is_bonded();
				doc["ble_encrypted"] = ble_hid_is_encrypted();
				doc["ble_pairing"] = ble_hid_is_pairing();
				doc["ble_peer_addr"] = ble_hid_peer_addr();
				doc["ble_peer_id_addr"] = ble_hid_peer_id_addr();
		}
		#endif

		// =====================================================================
		// USER-EXTEND: Add your own sensors to the web "health" API (/api/health)
		// =====================================================================
		// If you want your external sensors to show up in the web portal health widget,
		// add fields here.
		//
		// IMPORTANT:
		// - The key "cpu_temperature" is used for the SoC/internal temperature.
		//   You can safely use "temperature" for an external/ambient sensor.
		// - If you also publish these over MQTT, keep the JSON keys identical in
		//   device_telemetry_fill_mqtt() so you can reuse the same HA templates.
		//
		// Example (commented out):
		// doc["temperature"] = 23.4;
		// doc["humidity"] = 55.2;

		// Sensor framework (optional adapters)
		JsonObject sensors = doc["sensors"].to<JsonObject>();
		sensor_manager_append_api(sensors);

		// Image fetch drop counters (active slots only)
		#if HAS_IMAGE_FETCH
		{
				JsonObject img = doc["image_fetch"].to<JsonObject>();
				for (int i = 0; i < IMAGE_SLOT_MAX; i++) {
						uint32_t drops = image_fetch_get_drops((image_slot_t)i);
						if (drops > 0) {
								char key[16];
								snprintf(key, sizeof(key), "slot_%d_drops", i);
								img[key] = drops;
						}
				}
		}
		#endif
}

void device_telemetry_fill_mqtt_scoped(JsonDocument &doc, MqttPublishScope scope) {
		if (scope == MqttPublishScope::SensorsOnly) {
				JsonObject root = doc.to<JsonObject>();
				sensor_manager_append_mqtt(root);
				return;
		}

		// For MQTT publishing we keep the payload focused on device/system telemetry.
		// MQTT connection/publish status is better represented by availability/LWT,
		// and many consumers can infer publish cadence from broker-side timestamps.
		// Keep mqtt_* fields in /api/health only.
		fill_common(doc, false, false, false);

		// =====================================================================
		// USER-EXTEND: Add your own sensors to the MQTT state payload
		// =====================================================================
		// The MQTT integration publishes ONE batched JSON document (retained) to:
		//   devices/<sanitized>/health/state
		// Home Assistant entities then extract values via value_template, e.g.:
		//   {{ value_json.temperature }}
		//
		// Add your custom sensor fields below.
		//
		// IMPORTANT:
		// - The key "cpu_temperature" is used for the SoC/internal temperature.
		//   You can safely use "temperature" for an external/ambient sensor.
		//
		// Example (commented out):
		// doc["temperature"] = 23.4;
		// doc["humidity"] = 55.2;

		if (scope == MqttPublishScope::All) {
				JsonObject root = doc.as<JsonObject>();
				sensor_manager_append_mqtt(root);
		}
}

void device_telemetry_fill_mqtt(JsonDocument &doc) {
		device_telemetry_fill_mqtt_scoped(doc, MqttPublishScope::All);
}

void device_telemetry_init() {
		if (flash_cache_initialized) return;

		cached_sketch_size = ESP.getSketchSize();
		cached_free_sketch_space = ESP.getFreeSketchSpace();
		flash_cache_initialized = true;

		// Heap allocation-failed hook. Fires once per failed heap_caps_*alloc, just
		// before NULL is returned to the caller (which usually triggers an assert
		// or crash shortly after). On ESP-Hosted SDIO this is what we need to
		// catch transport_drv_sta_tx copy_buff failures — the periodic 200 ms
		// sampler in health_history.cpp misses sub-sample-interval bursts.
		// Callback uses esp_rom_printf (ISR-/critical-section-safe) since the
		// failing allocation may originate from any context.
		struct AllocFailHook {
			static IRAM_ATTR void on_failed(size_t size, uint32_t caps, const char *function_name) {
				const uint32_t dma_free = (uint32_t)heap_caps_get_free_size(MALLOC_CAP_DMA | MALLOC_CAP_INTERNAL);
				const uint32_t dma_largest = (uint32_t)heap_caps_get_largest_free_block(MALLOC_CAP_DMA | MALLOC_CAP_INTERNAL);
				const uint32_t int_free = (uint32_t)heap_caps_get_free_size(MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT);
				esp_rom_printf(
					"\n[ALLOC-FAIL] size=%u caps=0x%08x dma_internal_free=%u dma_internal_largest=%u internal_free=%u caller=%s\n",
					(unsigned)size, (unsigned)caps,
					(unsigned)dma_free, (unsigned)dma_largest, (unsigned)int_free,
					function_name ? function_name : "?"
				);
			}
		};
		heap_caps_register_failed_alloc_callback(&AllocFailHook::on_failed);

