jantielens/esp32-macropad/src/app/device_telemetry.cpp
		out->heap_internal_free_min_window = (uint32_t)merged.internal_free_min;
		out->heap_internal_free_max_window = (uint32_t)merged.internal_free_max;
		out->heap_fragmentation_max_window = internal_frag_now;
		out->psram_free_min_window = (uint32_t)merged.psram_free_min;
		out->psram_free_max_window = (uint32_t)merged.psram_free_max;

		return true;
}

bool device_telemetry_get_health_window_bands(DeviceHealthWindowBands* out_bands) {
		if (!out_bands) return false;
		HealthWindowComputed c = {};
		if (!compute_health_window_computed(&c)) return false;

		out_bands->heap_internal_free_min_window = c.heap_internal_free_min_window;
		out_bands->heap_internal_free_max_window = c.heap_internal_free_max_window;
		out_bands->psram_free_min_window = c.psram_free_min_window;
		out_bands->psram_free_max_window = c.psram_free_max_window;
		return true;
}

static void fill_common(JsonDocument &doc, bool include_ip_and_channel, bool include_api_only_fields, bool include_mqtt_self_report) {
		// System
		uint64_t uptime_us = esp_timer_get_time();
		doc["uptime_seconds"] = uptime_us / 1000000;

		// Reset reason
		esp_reset_reason_t reset_reason = esp_reset_reason();
		const char* reset_str = "Unknown";
		switch (reset_reason) {
				case ESP_RST_POWERON:   reset_str = "Power On"; break;
				case ESP_RST_SW:        reset_str = "Software"; break;
				case ESP_RST_PANIC:     reset_str = "Panic"; break;
				case ESP_RST_INT_WDT:   reset_str = "Interrupt WDT"; break;
				case ESP_RST_TASK_WDT:  reset_str = "Task WDT"; break;
				case ESP_RST_WDT:       reset_str = "WDT"; break;
				case ESP_RST_DEEPSLEEP: reset_str = "Deep Sleep"; break;
				case ESP_RST_BROWNOUT:  reset_str = "Brownout"; break;
				case ESP_RST_SDIO:      reset_str = "SDIO"; break;
				default: break;
		}
		doc["reset_reason"] = reset_str;

		// CPU usage (nullable when runtime stats are unavailable)
		int cpu_usage = -1;
		int cpu_usage_per_core[portNUM_PROCESSORS] = {};
		device_telemetry_get_cpu_usage_snapshot(&cpu_usage, cpu_usage_per_core, portNUM_PROCESSORS);
		if (cpu_usage < 0) {
				doc["cpu_usage"] = nullptr;
		} else {
				doc["cpu_usage"] = cpu_usage;
		}

		// Per-core values are API-only diagnostics. Keep MQTT's established
		// aggregate schema unchanged, and omit the fields where unavailable.
		#if portNUM_PROCESSORS > 1
		if (include_api_only_fields) {
			for (uint8_t core = 0; core < portNUM_PROCESSORS; ++core) {
				const int core_usage = cpu_usage_per_core[core];
				if (core_usage < 0) continue;
				char field[20];
				snprintf(field, sizeof(field), "cpu_usage_core_%u", (unsigned)core);
				doc[field] = core_usage;
			}
		}
		#endif

		// CPU / SoC temperature (persistent handle, installed once in device_telemetry_init)
#if SOC_TEMP_SENSOR_SUPPORTED
		{
				float temp_celsius = 0;
				if (s_temp_sensor && temperature_sensor_get_celsius(s_temp_sensor, &temp_celsius) == ESP_OK) {
						doc["cpu_temperature"] = (int)temp_celsius;
				} else {
						doc["cpu_temperature"] = nullptr;
				}
		}
#else
		doc["cpu_temperature"] = nullptr;
#endif

		// Memory — only internal heap + PSRAM free/min (no PSRAM free-list walks).
		// Mixed heap_free/heap_min removed (confusing on PSRAM boards).
		// psram_largest/psram_fragmentation removed (expensive PSRAM free-list walk).
		const size_t internal_free = heap_caps_get_free_size(MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT);
		const size_t internal_min = heap_caps_get_minimum_free_size(MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT);
		const size_t internal_largest_cached = get_internal_largest_free_block();
		const size_t internal_largest = (internal_largest_cached < internal_free)
				? internal_largest_cached : internal_free;

		doc["heap_internal_free"] = internal_free;
		doc["heap_internal_min"] = internal_min;
		doc["heap_internal_largest"] = internal_largest;

		// DMA-capable internal heap subset. On ESP-Hosted SDIO boards (ESP32-P4)
		// AsyncTCP/LWIP TX pbufs are allocated from this pool; exhaustion or
		// fragmentation here is what triggers transport_drv copy_buff NULL asserts
		// under portal load. Expose separately so the actual failure signal is
		// observable (the broader internal heap can look healthy while this pool
		// is empty).
		const size_t dma_internal_free = heap_caps_get_free_size(MALLOC_CAP_DMA | MALLOC_CAP_INTERNAL);
		const size_t dma_internal_min = heap_caps_get_minimum_free_size(MALLOC_CAP_DMA | MALLOC_CAP_INTERNAL);
		const size_t dma_internal_largest_cached = get_dma_internal_largest_free_block();
		const size_t dma_internal_largest = (dma_internal_largest_cached < dma_internal_free)
				? dma_internal_largest_cached : dma_internal_free;
		doc["heap_dma_internal_free"] = dma_internal_free;
		doc["heap_dma_internal_min"] = dma_internal_min;
		doc["heap_dma_internal_largest"] = dma_internal_largest;

		// Heap fragmentation (internal only)
		float heap_frag = 0;
		if (internal_free > 0 && internal_largest <= internal_free) {
				heap_frag = (1.0f - ((float)internal_largest / (float)internal_free)) * 100.0f;
		}
		if (heap_frag < 0) heap_frag = 0;
		if (heap_frag > 100) heap_frag = 100;
		doc["heap_fragmentation"] = (int)heap_frag;

#if SOC_SPIRAM_SUPPORTED
		const size_t psram_free = heap_caps_get_free_size(MALLOC_CAP_SPIRAM);
		const size_t psram_min = heap_caps_get_minimum_free_size(MALLOC_CAP_SPIRAM);
		doc["psram_free"] = psram_free;
		doc["psram_min"] = psram_min;
#else
		doc["psram_free"] = 0;
		doc["psram_min"] = 0;
#endif

		// Flash usage
		const size_t sketch_size = device_telemetry_sketch_size();
		const size_t free_sketch_space = device_telemetry_free_sketch_space();
		doc["flash_used"] = sketch_size;
		doc["flash_total"] = sketch_size + free_sketch_space;

		// Filesystem health is cached by the selected storage backend.
		{
				FSHealthStats fs;
				fs_health_get(&fs);
				device_telemetry_append_fs_health(doc, fs);
		}

		// MQTT health (self-report)
		// Only included in the web API (/api/health). For MQTT consumers, availability/LWT is a better
		// source of truth, and retained state can make connection booleans misleading.
		if (include_mqtt_self_report) {
				#if HAS_MQTT
				{
						doc["mqtt_enabled"] = mqtt_manager.enabled() ? true : false;
						doc["mqtt_publish_enabled"] = mqtt_manager.publishEnabled() ? true : false;
						doc["mqtt_connected"] = mqtt_manager.connected() ? true : false;

						const unsigned long last_pub = mqtt_manager.lastHealthPublishMs();
						if (last_pub == 0) {
								doc["mqtt_last_health_publish_ms"] = nullptr;
								doc["mqtt_health_publish_age_ms"] = nullptr;
						} else {
								doc["mqtt_last_health_publish_ms"] = last_pub;
								doc["mqtt_health_publish_age_ms"] = (unsigned long)(millis() - last_pub);
						}
				}
				#else
				doc["mqtt_enabled"] = false;
				doc["mqtt_publish_enabled"] = false;
				doc["mqtt_connected"] = false;
				doc["mqtt_last_health_publish_ms"] = nullptr;
				doc["mqtt_health_publish_age_ms"] = nullptr;
				#endif
		}

		// Display FPS (API-only; excluded from MQTT payload).
	if (include_api_only_fields) {
				#if HAS_DISPLAY
				if (displayManager) {
						DisplayPerfStats stats;
						if (display_manager_get_perf_stats(&stats)) {
								doc["display_fps"] = stats.fps;
						} else {
								doc["display_fps"] = nullptr;
						}
				} else {
						doc["display_fps"] = nullptr;
				}
				#else
				doc["display_fps"] = nullptr;
				#endif
		}

// WiFi stats — use cached RSSI to avoid ESP-Hosted RPC on every publish.
	if (WiFi.status() == WL_CONNECTED) {
			bool rssi_ok = false;
			int16_t rssi = device_telemetry_get_cached_rssi(&rssi_ok);
			doc["wifi_rssi"] = rssi_ok ? (int)rssi : (int)0;

				if (include_ip_and_channel) {
						doc["wifi_channel"] = WiFi.channel();

						// Avoid heap churn in String::toString() by formatting into a fixed buffer.
						char ip_buf[16];
						snprintf(ip_buf, sizeof(ip_buf), "%u.%u.%u.%u", WiFi.localIP()[0], WiFi.localIP()[1], WiFi.localIP()[2], WiFi.localIP()[3]);
						doc["ip_address"] = ip_buf;

						doc["hostname"] = WiFi.getHostname();
				}
		} else {
				doc["wifi_rssi"] = nullptr;

				if (include_ip_and_channel) {
						doc["wifi_channel"] = nullptr;
						doc["ip_address"] = nullptr;
						doc["hostname"] = nullptr;
				}
		}
}

static void get_memory_snapshot(
		size_t *out_heap_free,
		size_t *out_heap_min,
		size_t *out_heap_largest,
		size_t *out_internal_free,
		size_t *out_internal_min,
		size_t *out_psram_free,
		size_t *out_psram_min,
		size_t *out_psram_largest
) {
		if (out_heap_free) *out_heap_free = ESP.getFreeHeap();
		if (out_heap_min) *out_heap_min = ESP.getMinFreeHeap();

		if (out_heap_largest) {
				// Keep this consistent with ESP.getFreeHeap() (internal heap): use INTERNAL 8-bit largest block.
				*out_heap_largest = get_internal_largest_free_block();
		}

		if (out_internal_free) {
				*out_internal_free = heap_caps_get_free_size(MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT);
		}
		if (out_internal_min) {
				*out_internal_min = heap_caps_get_minimum_free_size(MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT);
		}

#if SOC_SPIRAM_SUPPORTED
		if (out_psram_free) {
				*out_psram_free = heap_caps_get_free_size(MALLOC_CAP_SPIRAM);
		}
		if (out_psram_min) {
				*out_psram_min = heap_caps_get_minimum_free_size(MALLOC_CAP_SPIRAM);
		}
		if (out_psram_largest) {
				#if TELEMETRY_ALLOW_PSRAM_POOL_WALK
				*out_psram_largest = heap_caps_get_largest_free_block(MALLOC_CAP_SPIRAM);
				#else
				*out_psram_largest = 0;
				#endif
		}
#else
		if (out_psram_free) *out_psram_free = 0;
		if (out_psram_min) *out_psram_min = 0;
		if (out_psram_largest) *out_psram_largest = 0;
#endif
}